{"format": "layers-model", "generatedBy": "keras v2.2.2", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"config": [{"config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [8, 8], "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 80, 110, 1], "bias_constraint": null, "filters": 16, "bias_regularizer": null, "use_bias": true, "strides": [4, 4], "padding": "valid", "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_size": [5, 5], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "padding": "same", "filters": 32, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_1", "units": 512, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_2", "units": 2, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "optimizer_config": {"config": {"decay": 0.0, "amsgrad": false, "epsilon": 1e-07, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [8, 8, 1, 16], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [32, 512], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 2], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}]}]}